<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Python_Data_Analytics_Course/blob/main/4_Problems/2_10_Pandas Applying Functions.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

## ðŸŸ© Convert Date to String (2.10.1)

In [ ]:
# Problem Statement:
# Convert the job_posted_date column to a string format 'YYYY-MM-DD' and create a new column job_posted_date_str.

df['job_posted_date_str']=df.job_posted_date.dt.strftime('%Y-%m-%d')
df.job_posted_date.apply(lambda date: date.strftime('%Y-%m-%d')).head()

0    2023-06-16
1    2023-01-14
2    2023-10-10
3    2023-07-04
4    2023-08-07
Name: job_posted_date, dtype: object

---

## ðŸŸ¨ Days Since Posted (2.10.2)

In [41]:
# Problem Statement:
# Calculate the number of days since each job was posted. Create a new column days_since_posted that contains this value. 
# Use the job_posted_date column.

# Note: You need to import the datetime library and use the datetime module to get the current date using .now().
from datetime import datetime
df['days_since_posted']=df.job_posted_date.apply(lambda x: (datetime.now()-x).days)
df[['job_posted_date','days_since_posted']].head()

      job_posted_date  days_since_posted
0 2023-06-16 13:44:15                726
1 2023-01-14 13:18:07                879
2 2023-10-10 13:14:55                610
3 2023-07-04 13:01:41                708
4 2023-08-07 14:29:36                674

---

## ðŸŸ¥ Salary Category (2.10.3)

In [52]:
# Problem Statement:
# Create a copy of the DataFrame called df_filtered and drop the NaN values for salary_year_avg.
# Then, create a new column salary_category that categorizes the salary_year_avg into three categories: 'Low' for salaries less than 60,000, 
# 'Medium' for salaries between 60,000 and 100,000, and 'High' for salaries greater than 100,000.
# Then show the df_filtered DataFrame and the salary_year_avg and salary_category columns.

df_filtered=df.dropna(subset='salary_year_avg').copy()
df_filtered['salary_category']=df_filtered.salary_year_avg.apply(lambda x: 'Low' if x<60000 else('Medium' if x<100000 else 'High'))
df_filtered[['salary_year_avg','salary_category']]

        salary_year_avg salary_category
28             109500.0            High
77             140000.0            High
92             120000.0            High
100            228222.0            High
109             89000.0          Medium
...                 ...             ...
785624         139216.0            High
785641         150000.0            High
785648         221875.0            High
785682         157500.0            High
785692         157500.0            High

[22003 rows x 2 columns]

---